<?php

return [
    'play_in_gp_or_pv' => '• بازی در گروه یا پیوی🎮' ,
    'play_with_unknown' => '👀بازی با ناشناس •',
    'friend' => '• دوستان👤',
    'support' => '• پشتیبانی👨‍💻',
    'info' => '⁉️راهنما •',
    'account' => '• حساب کاربری •',
    'leaderboard' => '🥇نفرات برتر •',
    'tournament' => '🏆شرکت در مسابقه 8 نفره + جایزه🎁',
    'add_money' => "💸 کسب درآمد 💸",

    'friend_list' => 'لیست دوستان 👤 •' ,
    'friend_add' => "• افزودن دوست ➕",
    'friend_requests' => '• 💌 درخواست ها •' ,

    'leaderboard_score' => 'تعداد جام 🏆' ,
    'leaderboard_winrate' => 'درصد برد 🥇' ,
    'leaderboard_experience' => 'تجربه 👨‍🦳' ,
    'leaderboard_winer' => 'قهرمانی 🔥' ,

    'referral' => '👥 زیر مجموعه گیری',

    'report' => '⚠️ گزارش',
    'reject' => '❌ قطع ارتباط',

    'send_game' => '🎮  ارسال بازی ' ,

    'inventory' => '💰 موجودی',
    'withdrawal' => 'برداشت موجودی 💳',


];