<?php

return [
  'start' => "سلااام %firstname% عزیززز به ربات بازی ما خوشومدییی❤️‍🔥

قراره اینجا کلی خوشبگذره بهت😼

با افراد ناشناس بازی کنی و دوست پیدا کنی 😁

تمرین کنی و قوی شی مسابقاتمون شرکت کنی و جایزه برنده شیی 😻

با رفیقات بازی کنی و ببینی کدومتون قوی و باهوش هستید 😹

همین حالا با استفاده از دکمه های زیر از ربات استفاده کن و لذت ببرر👇" ,

    'support_clicked' => "• به بخش پشتیبانی ربات خوشومدی(: 🤍

• سعی بخش پشتیبانی بر این است که تمامی پیام های دریافتی در کمتر از ۱۲ ساعت پاسخ داده شوند، بنابراین تا زمان دریافت پاسخ صبور باشید

• لطفا پیام، سوال، پیشنهاد و یا انتقاد خود را در قالب یک پیام واحد و بدون احوالپرسی و ... ارسال کنید 👇🏻

👨‍💻 @Doz_Sup",
    'account'=> "
    🪪 حساب کاربری شما به شرح زیر میباشد :

 🆔 نام کاربری :      %username%
🔢 آیدی عددی :      %telegram_id%

🎮 تعداد بازیهای انجام شده:      %matches_count%
🔆 رتبه تعداد بازی بین کاربران:     %matches_rank%

➗ درصد برد در کل بازیها:     %win_rate%
〽️ رتبه درصد برد بین کاربران:     %win_rate_rank%

🥇 تعداد قهرمانی در مسابقه: coming soon
🎊 رتبه قهرمانی در مسابقه: coming soon

🏆 موجودی جام:     %cups%
 💎 موجودی دلتاکوین:     %doz_coin%

👥 تعداد دوستان:     %friends_count%
⏰ تاریخ و ساعت ورود:     %joined_at%
    ",
    'force_join' => 'کاربر گرامی برای باز شدن قفل ربات و همچنین حمایت از ما باید در کانال زیر عضو شده و سپس روی دکمه عضو شدم کلیک کنید👇❤️ ',
    'force_rejoin' => '⚠️ شما هنوز در تمامی کانال های ما عضو نشدید .',
    'i_join' => 'عضو شدم ✅' ,
    'info' => "🎮 نحوه بازی : 
1️⃣ با انتخاب هر دکمه ( 1 تا 7 ) یک مهره داخل ستون مربوطه می افتد و در پایین ترین محل خالی قرار میگیرد. 

2️⃣ دو نفر به نوبت بازی میکنند و به یک بازیکن رنگ 🔵 و بازیکن دیگر رنگ 🔴 اختصاص داده میشود.

3️⃣ بازیکنان باید تلاش کنند تا 4 مهره از رنگ خود را به صورت عمودی، افقی یا مایل مانند شکل زیر ردیف کنند.

به 3 مثال زیر توجه کنید :

1- برنده : آبی    روش: افقی
⚪️⚪️⚪️⚪️⚪️⚪️⚪️
⚪️⚪️⚪️⚪️⚪️⚪️⚪️
⚪️⚪️⚪️⚪️⚪️⚪️⚪️
⚪️⚪️⚪️🔴⚪️⚪️⚪️
⚪️🔵🔵🔵🔵⚪️⚪️
⚪️🔴🔴🔴🔵⚪️⚪️
1️⃣2️⃣3️⃣4️⃣5️⃣6️⃣7️⃣

2- برنده : قرمز     روش: مایل
⚪️⚪️⚪️⚪️⚪️⚪️⚪️
⚪️⚪️⚪️⚪️⚪️⚪️⚪️
⚪️⚪️⚪️⚪️⚪️⚪️🔴
⚪️⚪️⚪️⚪️⚪️🔴🔵
⚪️⚪️⚪️⚪️🔴🔵🔴
🔴⚪️🔵🔴🔵🔵🔵
1️⃣2️⃣3️⃣4️⃣5️⃣6️⃣7️⃣

3- برنده : آبی      روش: عمودی
⚪️⚪️⚪️⚪️⚪️⚪️⚪️
⚪️⚪️⚪️⚪️⚪️⚪️⚪️
⚪️⚪️⚪️🔵⚪️⚪️⚪️
⚪️⚪️⚪️🔵🔴⚪️⚪️
⚪️⚪️⚪️🔵🔴⚪️⚪️
⚪️⚪️⚪️🔵🔴⚪️⚪️
1️⃣2️⃣3️⃣4️⃣5️⃣6️⃣7️⃣

دو سه بار بازی کنی قلق کار دستت میاد ❤️‍🔥
بازی خوبی داشته باشی 🫂
" ,

    'set_username' => "سلام  %firstname% عزیز به ربات دوز گیم خوشومدی ❤️ 

🆔 جهت انجام بازی میبایست در ربات نام کاربری (آیدی) داشته باشید .

⚠️ توجه : 
1️⃣ نام کاربری ( آیدی ) مورد نظر باید 5 حرفی یا بیشتر باشد .
2️⃣ نام کاربری ( آیدی ) فقط میتواند شامل حروف و اعداد انگلیسی باشد.
3️⃣ امکان تغییر نام کاربری وجود ندارد پس در انتخاب آن دقت حاصل فرمایید.

برای مثال : aTiLa",

    'bad_username' => "نام کاربری ارسالی کمتر از 5 حرف میباشد و یا توسط دیگری استفاده شده است ‼️ 

⚠️ توجه : نام کاربری فقط میتواند شامل حروف و اعداد انگلیسی باشد." ,
    'username_exits' => "❌ نام کاربری از قبل وجود دارد لطفا نام کاربری دیگری انتخاب کنید . " ,
    'username_ok' => '✅ نام کاربری شما با موفقیت به %username% تغییر کرد . ' ,
    'choose' => 'با استفاده از دکمه های زیر بخش مورد نظر را انتخاب کنید👇' ,
    'user_not_found' => '⚠️ کاربری با این نام کاربری پیدا نشد . ' ,
    'friend_request_sent' => '✅ درخواست دوستی شما به کاربر %username% ارسال شد .' ,
    'friend_request_exist' => '⚠️ درخواست دوستی شما از قبل ارسال شده . ' ,
    'friend_exist' => '⚠️ کاربر با نام کاربری %username% از قبل در لیست دوستان شما وجود دارد .' ,
    'friend_request' => ' #درخواست_دوستی جدید : ' . PHP_EOL . " - از طرف : %username%" ,
    'friend_request_before' => ' ℹ️ نام کاربری کاربر مورد نظر را ارسال کنید .' ,
    'friend_request_accepted' => '✅ درخواست دوستی شما توسط کاربر %username% قبول شد .',
    'friend_request_accepted_fast' => '✅ کاربر %username% به لیست دوستان شما اضافه شد .' ,
    'friend_request_self_error' => '⚠️ شما نمیتوانید به خودتان درخواست دوستی بدهید . ' ,


    'friend_request_rejected' => '❌ درخواست دوستی شما توسط کاربر %username% رد شد .',
    'friend_request_rejected_fast' => '❌ شما درخواست دوستی کاربر %username% را رد کردید .' ,
    'no_request_exist' => '⚠️ درخواست دوستی برای شما وجود ندارد . ',
    'no_friend_exist' => '⚠️ شما هنوز دوستی ندارید .',
    'friend_request_list' => '💌 لیست درخواست دوستی های شما : ',
    'friend_list_text' => '👥 لیست دوستان شما :' ,
    'friend_removed' => '⚠️ دوست شما با موفقیت از لیست حذف گردید .' ,

    'wrong_ref_link' => '❌ لینک عضویت اشتباه میباشد . ' . "\n\n" . "/start" ,
    'warning_joined_before' => '⚠️ شما از قبل وارد ربات شده اید . '  . "\n\n" . "/start" ,
    'ref_joined' => 'تبریک 🎉 یک نفر با لینک شما وارد ربات شد و شما 0.5 دلتاکوین دریافت کردید.
چنانچه کاربر موردنظر اولین بُرد خود را در ربات ثبت کند 1.5 دلتاکوین دیگر دریافت خواهید کرد . 

💰موجودی جدید : %doz_coin% دلتاکوین',

    'joined_successfully' => '✅ عضویت شما در کانال های ما تایید شد .',

    "processed" => "⚠️ این درخواست قبلا پردازش شده است ." ,
    'wait_for_friend' => "⚠️ لطفا منتظر دوست خود بمانید .",
    'u_can_play_now' => '🎮 شما هم اکنون میتوانید بازی را شروع کنید ' ,
    'who_play'=> 'v⚠️ فقط ارسال کننده بازی میتواند بازی را شروع کند .',
    'u_can_start_now' => '🎮 هم اکنون میتوانید وارد بازی بشید . ',
    'u_have_old_match' => 'بازی قبلی شما در جریان است لطفا منتظر بمانید ...',
    'ur_friend_have_old_match' => 'دوست شما در بازی دیگری است لطفا بعدا تلاش کنید ...',
    'game_req_send' => '✅ درخواست بازی شما برای کاربر ارسال شد و در صورت قبول کردن درخواست بازی شما شروع خواهد شد . ' ,
    'new_game_req' => '✔️ درخواست بازی جدید از طرف : ' ,
    'game_with_user' => '🎮 بازی شما با کاربر ' ,
    'started' => 'شروع شد .' ,
    'u_can_chat_now' => 'توجه : شما حین انجام بازی میتوانید با رقیب خود چت کنید 🗣' . PHP_EOL . PHP_EOL . "به رقیب خود سلام دهید 👀" ,
    'u_reject_game' => '❌ شما درخواست بازی کاربر ' ,
    'u_reject' => ' را رد کردید.' ,
    'he_reject_ur_game' => '❌ درخواست بازی شما توسط کاربر ' ,
    'he_reject' => ' رد شد.' ,
    'user_is_playing' => '🎮 کاربر مورد نظر در حال بازی میباشد .' ,
    'game_link' => '🎮 لینک ورود به بازی شما : ' ,
    'send_game_to_pv'=> '🎮 برای بازی با دوست خود روی دکمه زیر کلیک کرده و پیوی یا گروه موردنظرتو انتخاب کن 👇' ,
    'finding_player' => 'در حال یافتن بازیکن 🕔
    
برای لغو جستجو، دستور /cancel را ارسال کنید.',
    'cancel_search' => '✅ جستجوی بازیکن لغو شد.',
    'player_found' => '🎮 بازی شما با کاربر /%username% شروع شد برای انجام بازی روی دکمه شیشه ای زیر پیام کلیک کنید 👇
    
⚠️ توجه : برای ورود به بازی به دلیل فیلترینگ تلگرام در ایران vpn مورد نیاز است ‼️',
    'select_category' => '🏆 لیست نفرات برتر برحسب کدام دسته بندی ارسال شود ؟' ,
    'send_message_to_friend' => 'متن بالا رو برای دوستات فوروارد کن تا به ازای هر نفری که با لینک تو به ربات وارد میشن 2 دلتا کوین دریافت کنی💸' ,

    'send_link_to_friend' => 'سلام دوست من از طریق این ربات میتونی با افراد ناشناس بازی کنی و باهاشون چت کنی و در انواع مسابقات گروهی شرکت کنی🏆👀

فرق این ربات با رباتای دیگه اینه که میتونی کنار بازی کردن کسب درآمد هم کنی💸

همین حالا رو لینک زیر کلیک کن و باهام بازی کن 👇❤️' ,

    'select_way_to_pay' => 'شما میتوانید با ربات ما کسب درآمد کنید ، حالا چطوری ⁉️

💸 روش های کسب درآمد در ربات : 

1️⃣ ساده ترین روش کسب درآمد بازی کردن در ربات است . شما در قسمت بازی با ناشناس میتوانید به ازای هر بُرد 0.2 دلتا کوین دریافت کنید، توجه داشته باشید که به ازای هر باخت در این قسمت 0.1 دلتا کوین از دست میدهید. 
2️⃣ این روش از طریق زیرمجموعه گیری ممکن است. در این روش با کلیک بر روی دکمه زیرمجموعه گیری بنر و لینک اختصاصی خود را دریافت میکنید و به دوستانتان ارسال میکنید، به ازای هر دعوت از طریق لینک شما 2 دلتا کوین دریافت میکنید.
3️⃣ روش سوم هنوز در ربات اعمال نشده است. در این روش از طریق شرکت در مسابقات ربات که در قسمت تورنومنت ها، جوایز بُرد هر بازی مشخص شده است ، میتوانید به جوایز ارزنده ای دست یابید.

‼️ توجه : ارزش هر دلتا کوین ، هزار تومن میباشد
1 دلتا کوین = 1000 تومن
0.1 دلتا کوین = 100 تومن' ,
    'winRate_leaderboard' => '🥇 نفرات برتر در درصد برد  : ' ,
    'jam_leaderboard' => '🏆 نفرات برتر در تعداد جام  : ' ,
    'gameCount_leaderboard' => '🏆 نفرات برتر در تعداد بازی (تجربه)  : ',
    'u_reject_chat' => '❌ ارتباط شما با شخص مقابل قطع شد . ',
    'he_reject_chat' => 'کاربر مقابل قابلیت چت کردن را خاموش کرد ❌ ' ,
    'inventory_text' => "💰 موجودی دلتا کوین : %doz_coin% عدد 
💸 ارزش فعلی هر 1 دلتا کوین : 1,000 تومن
💳 موجودی شما به تومن : %balance% تومن" ,
    'error_min_withdrawal' => 'حداقل برداشت موجودی 50 دلتا کوین میباشد ❌ 
موجودی شما : %doz_coin% دلتا کوین' ,
    'withdrawal_ok' => "جهت برداشت موجودی لطفا به آیدی @doz_sup مراجعه کنید❤️",
    "firstMatch_unknown" => "چون دفعه اولته حتما این آموزشو با دقت بخون ⚠️

🎮 نحوه بازی : 
1️⃣ با انتخاب هر دکمه ( 1 تا 7 ) یک مهره داخل ستون مربوطه می افتد و در پایین ترین محل خالی قرار میگیرد. 

2️⃣ دو نفر به نوبت بازی میکنند و به یک بازیکن رنگ 🔵 و بازیکن دیگر رنگ 🔴 اختصاص داده میشود.

3️⃣ بازیکنان باید تلاش کنند تا 4 مهره از رنگ خود را به صورت عمودی، افقی یا مایل مانند شکل زیر ردیف کنند.

به 3 مثال زیر توجه کنید :

1- برنده : آبی    روش: افقی
⚪️⚪️⚪️⚪️⚪️⚪️⚪️
⚪️⚪️⚪️⚪️⚪️⚪️⚪️
⚪️⚪️⚪️⚪️⚪️⚪️⚪️
⚪️⚪️⚪️🔴⚪️⚪️⚪️
⚪️🔵🔵🔵🔵⚪️⚪️
⚪️🔴🔴🔴🔵⚪️⚪️
1️⃣2️⃣3️⃣4️⃣5️⃣6️⃣7️⃣

2- برنده : قرمز     روش: مایل
⚪️⚪️⚪️⚪️⚪️⚪️⚪️
⚪️⚪️⚪️⚪️⚪️⚪️⚪️
⚪️⚪️⚪️⚪️⚪️⚪️🔴
⚪️⚪️⚪️⚪️⚪️🔴🔵
⚪️⚪️⚪️⚪️🔴🔵🔴
🔴⚪️🔵🔴🔵🔵🔵
1️⃣2️⃣3️⃣4️⃣5️⃣6️⃣7️⃣

3- برنده : آبی      روش: عمودی
⚪️⚪️⚪️⚪️⚪️⚪️⚪️
⚪️⚪️⚪️⚪️⚪️⚪️⚪️
⚪️⚪️⚪️🔵⚪️⚪️⚪️
⚪️⚪️⚪️🔵🔴⚪️⚪️
⚪️⚪️⚪️🔵🔴⚪️⚪️
⚪️⚪️⚪️🔵🔴⚪️⚪️
1️⃣2️⃣3️⃣4️⃣5️⃣6️⃣7️⃣

دو سه بار بازی کنی قلق کار دستت میاد ❤️‍🔥
بازی خوبی داشته باشی 🫂

برای شروع بازی، مجددا روی دکمه بازی با ناشناس کلیک کنید 👇" ,
    ];